from django.db import models
from students.models import Student
from django.db.models.functions import Now

BEHAVIOR=[
        ('-------------------------','-------------------------'),
        ('المقاطعة المستمرة لشرح المعلم','لمقاطعة المستمرة لشرح المعلم'),
        ('كثرة الأحاديث الجانبية','كثرة الأحاديث الجانبية'),
        ('إثارة الفوضى داخل الصف والمدرسة','إثارة الفوضى داخل الصف والمدرسة'),
        ('لتحرك من مكانه بدون إذن','لتحرك من مكانه بدون إذن'),
        ('المشاجرة البسيطة دون وقوع ضرر','المشاجرة البسيطة دون وقوع ضرر'),
        ('إساءة الأدب مع المعلم','إساءة الأدب مع المعلم'),
        ('الشجار مع الزملاء بالتلفظ بالفاظ غير لائقة','الشجار مع الزملاء بالتلفظ بالفاظ غير لائقة'),
        ('التأخر عن الحضور','التأخر عن الحضور'),
        ('الهروب من الحصة بدون استاذان','الهروب من الحصة بدون استاذان'),
        ('رفض الطالب للإجراءات الإدارية الصادرة بحقه','رفض الطالب للإجراءات الإدارية الصادرة بحقه'),
        ('عدم إحضار الكتاب المدرسي','عدم إحضار الكتاب المدرسي')
        ]

class Note(models.Model):
    SCEANCE=[
        ('الحصة الأولى','الحصة الأولى'),
        ('الحصة الثانية','الحصة الثانية'),
        
    ]
    WEEKS=[
        ('----------------------','----------------------'),
        ('الأسبوع الاول','الأسبوع الاول'),
        ('الأسبوع الثاني','الأسبوع الثاني'),
        ('الأسبوع الثالث','الأسبوع الثالث'),
        ('الأسبوع الرابع','الأسبوع الرابع'),
        ('الأسبوع الخامس','الأسبوع الخامس'),
        ('الأسبوع السادس','الأسبوع السادس'),
        ('الأسبوع السابع','الأسبوع السابع'),
        ('الأسبوع الثامن','الأسبوع الثامن'),
        
    ]
    weeks=models.CharField(max_length=50,choices=WEEKS,default='---------------------')
    sceance=models.CharField(max_length=50,choices=SCEANCE,default='الحصة الأولى')
    behavior= models.CharField( max_length=200, choices=BEHAVIOR, default='---------------')
    student = models.ForeignKey(Student, on_delete=models.CASCADE)
    created = models.DateField(auto_now_add=True,verbose_name='تاريخ المخالفة')
    comment = models.TextField(blank=True)
    
    def __str__(self):
        return f"{self.student.name} "
    
    